In [3]:
import numpy as np
import pandas as pd

In [4]:
dataSet = {
    'name': ["Riyad", "Akash", "Roshni", "xyz"],
    'age': [23, 22, 24, 20],
    'Address': ["Badda", "Mirpur2", "Mirpur11", "Motijheel"]
}

df = pd.DataFrame(dataSet)
print(df)

     name  age    Address
0   Riyad   23      Badda
1   Akash   22    Mirpur2
2  Roshni   24   Mirpur11
3     xyz   20  Motijheel

In [5]:
df.to_csv('data.csv')

In [6]:
df.head(2)

    name  age  Address
0  Riyad   23    Badda
1  Akash   22  Mirpur2

In [7]:
df.tail(2)

     name  age    Address
2  Roshni   24   Mirpur11
3     xyz   20  Motijheel

In [8]:
df.describe()

             age
count   4.000000
mean   22.250000
std     1.707825
min    20.000000
25%    21.500000
50%    22.500000
75%    23.250000
max    24.000000

In [14]:
riyad = pd.read_csv(r'D:\ML and AI\Pandas')

NameError: name 'pd' is not defined

In [11]:
riyad[Speed][1] = 100

NameError: name 'riyad' is not defined

In [12]:
riyad

NameError: name 'riyad' is not defined